## Plan Result (sbox_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.api-mgmt.azurerm_api_management_logger.apim
  * module.api-mgmt.module.application_insights.azurerm_application_insights.this
* Move
  * module.api-mgmt.azurerm_application_insights.apim => module.api-mgmt.module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_logger.apim must be replaced
-/+ resource "azurerm_api_management_logger" "apim" {
      ~ id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-sbox/loggers/cft-api-mgmt-sbox-logger" -> (known after apply)
        name                = "cft-api-mgmt-sbox-logger"
      ~ resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-sbox" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ application_insights {
          ~ instrumentation_key = (sensitive value)
        }
    }

  # module.api-mgmt.module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from module.api-mgmt.azurerm_application_insights.apim)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "2710ac3b-efcd-4db9-bab2-f5d67530eb09" -> (known after apply)
      ~ application_type                      = "other" -> "web" # forces replacement
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-sbox" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "cft-api-mgmt-sbox"
      ~ retention_in_days                     = 30 -> 90
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1933,"Program":"tfcmt","SHA1":"","Target":"sbox_apim","Vars":{}} -->